Revit 2027 API
HVACZoneData Class
 Represents the specific domain requirements for a system-zone upgraded from an HVAC zone.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.GenericZoneDomainData
 Autodesk.Revit.DB.Mechanical.HVACZoneData
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HVACZoneData : GenericZoneDomainData
Public Class HVACZoneData
	Inherits GenericZoneDomainData
public ref class HVACZoneData : public GenericZoneDomainData
type HVACZoneData =
    class
        inherit GenericZoneDomainData
    end
The HVACZoneData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from GenericZoneDomainData)
ZoneEquipmentId |  The id of the zone equipment related to the zone.
Top
Methods
Name | Description
Dispose
(Inherited from GenericZoneDomainData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace